app/views/sakai_link/wsdl_def.html.erb

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://rigse.local/sakai-axis/SakaiSigning.jws" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="http://rigse.local/sakai-axis/SakaiSigning.jws" xmlns:intf="http://rigse.local/sakai-axis/SakaiSigning.jws" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<!--WSDL created by Apache Axis version: 1.3
Built on Oct 05, 2005 (05:23:37 EDT)-->

   <wsdl:message name="getsessionResponse1">

      <wsdl:part name="getsessionReturn" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="touchsessionRequest">

      <wsdl:part name="esessions" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="hex2byteRequest">

      <wsdl:part name="strhex" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="getsessionRequest1">

      <wsdl:part name="data" type="xsd:string"/>

      <wsdl:part name="object" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="verifysignRequest">

      <wsdl:part name="data" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="hex2byteResponse">

      <wsdl:part name="hex2byteReturn" type="xsd:base64Binary"/>

   </wsdl:message>

   <wsdl:message name="getsessionResponse">

      <wsdl:part name="getsessionReturn" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="touchsessionResponse">

      <wsdl:part name="touchsessionReturn" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="verifysignResponse">

      <wsdl:part name="verifysignReturn" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="getsessionRequest">

      <wsdl:part name="object" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="testsignResponse">

      <wsdl:part name="testsignReturn" type="xsd:string"/>

   </wsdl:message>

   <wsdl:message name="testsignRequest">

      <wsdl:part name="data" type="xsd:string"/>

   </wsdl:message>

   <wsdl:portType name="SakaiSigning">

      <wsdl:operation name="testsign" parameterOrder="data">

         <wsdl:input message="impl:testsignRequest" name="testsignRequest"/>

         <wsdl:output message="impl:testsignResponse" name="testsignResponse"/>

      </wsdl:operation>

      <wsdl:operation name="verifysign" parameterOrder="data">

         <wsdl:input message="impl:verifysignRequest" name="verifysignRequest"/>

         <wsdl:output message="impl:verifysignResponse" name="verifysignResponse"/>

      </wsdl:operation>

      <wsdl:operation name="getsession" parameterOrder="object">

         <wsdl:input message="impl:getsessionRequest" name="getsessionRequest"/>

         <wsdl:output message="impl:getsessionResponse" name="getsessionResponse"/>

      </wsdl:operation>

      <wsdl:operation name="getsession" parameterOrder="data object">

         <wsdl:input message="impl:getsessionRequest1" name="getsessionRequest1"/>

         <wsdl:output message="impl:getsessionResponse1" name="getsessionResponse1"/>

      </wsdl:operation>

      <wsdl:operation name="touchsession" parameterOrder="esessions">

         <wsdl:input message="impl:touchsessionRequest" name="touchsessionRequest"/>

         <wsdl:output message="impl:touchsessionResponse" name="touchsessionResponse"/>

      </wsdl:operation>

      <wsdl:operation name="hex2byte" parameterOrder="strhex">

         <wsdl:input message="impl:hex2byteRequest" name="hex2byteRequest"/>

         <wsdl:output message="impl:hex2byteResponse" name="hex2byteResponse"/>

      </wsdl:operation>

   </wsdl:portType>

   <wsdl:binding name="SakaiSigningSoapBinding" type="impl:SakaiSigning">

      <wsdlsoap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>

      <wsdl:operation name="testsign">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="testsignRequest">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://DefaultNamespace" use="encoded"/>

         </wsdl:input>

         <wsdl:output name="testsignResponse">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://rigse.local/sakai-axis/SakaiSigning.jws" use="encoded"/>

         </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="verifysign">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="verifysignRequest">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://DefaultNamespace" use="encoded"/>

         </wsdl:input>

         <wsdl:output name="verifysignResponse">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://rigse.local/sakai-axis/SakaiSigning.jws" use="encoded"/>

         </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="getsession">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="getsessionRequest">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://DefaultNamespace" use="encoded"/>

         </wsdl:input>

         <wsdl:output name="getsessionResponse">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://rigse.local/sakai-axis/SakaiSigning.jws" use="encoded"/>

         </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="getsession">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="getsessionRequest1">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://DefaultNamespace" use="encoded"/>

         </wsdl:input>

         <wsdl:output name="getsessionResponse1">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://rigse.local/sakai-axis/SakaiSigning.jws" use="encoded"/>

         </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="touchsession">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="touchsessionRequest">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://DefaultNamespace" use="encoded"/>

         </wsdl:input>

         <wsdl:output name="touchsessionResponse">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://rigse.local/sakai-axis/SakaiSigning.jws" use="encoded"/>

         </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="hex2byte">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="hex2byteRequest">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://DefaultNamespace" use="encoded"/>

         </wsdl:input>

         <wsdl:output name="hex2byteResponse">

            <wsdlsoap:body encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" namespace="http://rigse.local/sakai-axis/SakaiSigning.jws" use="encoded"/>

         </wsdl:output>

      </wsdl:operation>

   </wsdl:binding>

   <wsdl:service name="SakaiSigningService">

      <wsdl:port binding="impl:SakaiSigningSoapBinding" name="SakaiSigning">

         <wsdlsoap:address location="http://rigse.local/sakai-axis/SakaiSigning.jws"/>

      </wsdl:port>

   </wsdl:service>

</wsdl:definitions>