app/views/sakai_link/wsdl_verify.html.erb

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:testsign xmlns:n1="http://DefaultNamespace"
        env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
      <data xsi:type="xsd:string">success</data>
    </n1:testsign>
  </env:Body>
</env:Envelope>